zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_unicommspi.h
 *  @brief      Unified Communication Module (UNICOMM) - Serial Peripheral Interface (SPI) Driver Library
 *  @defgroup   UNICOMMSPI Unified Communication Module (UNICOMM) - Serial Peripheral Interface (SPI)
 *
 *  @anchor ti_dl_dl_unicommspi_Overview
 *  # Overview
 *
 *  The Unified Communication Module Serial Peripheral Interface Driver Library allows
 *  full configuration of the UNICOMM SPI module.
 *
 *  This Serial Peripheral Interface (SPI) module provides a standardized
 *  serial interface to transfer data between devices and other external
 *  devices with SPI interface.
 *
 *  统一通信模块 SPI 驱动库，支持 SPI 外设的完整配置，包括主从模式、帧格式、
 *  数据位宽、校验、时钟分频、FIFO 阈值、DMA 触发及低功耗配置备份/恢复等。
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup UNICOMMSPI
 * @{
 */
#ifndef ti_dl_dl_unicommspi__include
#define ti_dl_dl_unicommspi__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/dl_unicomm.h>

#ifdef __MCU_HAS_UNICOMMSPI__

#ifdef __cplusplus
extern "C"
{
#endif

    /* clang-format off */

/** @addtogroup DL_SPI_CD_MODE
 *  @{
 */
/*!
 * @brief Data mode  数据模式，C/D 引脚高电平
 */
#define DL_SPI_CD_MODE_DATA             (UNICOMMSPI_CTL1_CDMODE_DATA >> UNICOMMSPI_CTL1_CDMODE_OFS)

/*!
 * @brief Command mode  命令模式，C/D 引脚低电平
 */
#define DL_SPI_CD_MODE_COMMAND       (UNICOMMSPI_CTL1_CDMODE_COMMAND >> UNICOMMSPI_CTL1_CDMODE_OFS)


/** @}*/

/** @addtogroup DL_SPI_INTERRUPT
 *  @{
 */

/*!
 * @brief DMA done 1 event for transmit interrupt  DMA 发送完成中断
 */
#define DL_SPI_INTERRUPT_DMA_DONE_TX                    (UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA done 1 event for receive interrupt  DMA 接收完成中断
 */
#define DL_SPI_INTERRUPT_DMA_DONE_RX                    (UNICOMMSPI_CPU_INT_IMASK_DMA_DONE_RX_SET)

/*!
 * @brief DMA done 1 event for  PREIRQ RX interrupt  DMA 接收预中断
 */
#define DL_SPI_INTERRUPT_DMA_PREIRQ_RX                (UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_RX_SET)

/*!
 * @brief DMA done 1 event for  PREIRQ TX interrupt  DMA 发送预中断
 */
#define DL_SPI_INTERRUPT_DMA_PREIRQ_TX    (UNICOMMSPI_CPU_INT_IMASK_DMA_PREIRQ_TX_SET)

/*!
 * @brief DMA done 1 event for LTOUT interrupt  总线超时中断
 */
#define DL_SPI_INTERRUPT_LTOUT    (UNICOMMSPI_CPU_INT_IMASK_LTOUT_SET)

/*!
 * @brief SPI has finished transfers and changed into idle mode interrupt  SPI 空闲中断
 */
#define DL_SPI_INTERRUPT_IDLE                   (UNICOMMSPI_CPU_INT_IMASK_IDLE_SET)

/*!
 * @brief Transmit FIFO empty interrupt  发送 FIFO 空中断
 */
#define DL_SPI_INTERRUPT_TX_EMPTY            (UNICOMMSPI_CPU_INT_IMASK_TXEMPTY_SET)

/*!
 * @brief Transmit FIFO interrupt  发送 FIFO 触发中断
 */
#define DL_SPI_INTERRUPT_TX                       (UNICOMMSPI_CPU_INT_IMASK_TX_SET)

/*!
 * @brief Receive FIFO interrupt  接收 FIFO 触发中断
 */
#define DL_SPI_INTERRUPT_RX                       (UNICOMMSPI_CPU_INT_IMASK_RX_SET)

/*!
 * @brief Receive timeout interrupt  接收超时中断
 */
#define DL_SPI_INTERRUPT_RX_TIMEOUT            (UNICOMMSPI_CPU_INT_IMASK_RTOUT_SET)

/*!
 * @brief Receive FIFO full interrupt  接收 FIFO 满中断
 */
#define DL_SPI_INTERRUPT_RX_FULL              (UNICOMMSPI_CPU_INT_IMASK_RXFULL_SET)

/*!
 * @brief Transmit FIFO underflow interrupt  发送 FIFO 下溢中断
 */
#define DL_SPI_INTERRUPT_TX_UNDERFLOW     (UNICOMMSPI_CPU_INT_IMASK_TXFIFO_UNF_SET)

/*!
 * @brief Parity error  校验错误中断
 */
#define DL_SPI_INTERRUPT_PARITY_ERROR            (UNICOMMSPI_CPU_INT_IMASK_PER_SET)

/*!
 * @brief Receive FIFO overflow interrupt  接收 FIFO 上溢中断
 */
#define DL_SPI_INTERRUPT_RX_OVERFLOW      (UNICOMMSPI_CPU_INT_IMASK_RXFIFO_OVF_SET)

/** @}*/


/** @addtogroup DL_SPI_DMA_INTERRUPT_RX
 *  @{
 */
/*!
 * @brief SPI interrupt for enabling SPI receive as DMA trigger  SPI 接收 DMA 触发
 */
#define DL_SPI_DMA_INTERRUPT_RX               (UNICOMMSPI_DMA_TRIG_RX_IMASK_RX_SET)

/*!
 * @brief SPI interrupt for enabling SPI receive timeout as DMA trigger  SPI 接收超时 DMA 触发
 */
#define DL_SPI_DMA_INTERRUPT_RX_TIMEOUT       (UNICOMMSPI_DMA_TRIG_RX_IMASK_RTOUT_SET)

/** @}*/

/*!
 * @brief SPI interrupt for enabling SPI transmit as DMA trigger  SPI 发送 DMA 触发
 */
#define DL_SPI_DMA_INTERRUPT_TX               (UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_SET)

    /* clang-format on */

    /*! @enum DL_SPI_PARITY  SPI 校验模式 */
    typedef enum
    {
        /*! Use even parity, enable transmit and receive parity  偶校验，收发均使能 */
        DL_SPI_PARITY_EVEN =
            (UNICOMMSPI_CTL1_PES_ENABLE | UNICOMMSPI_CTL1_PREN_ENABLE |
             UNICOMMSPI_CTL1_PTEN_ENABLE),
        /*! Use odd parity, enable transmit and receive parity  奇校验，收发均使能 */
        DL_SPI_PARITY_ODD =
            (UNICOMMSPI_CTL1_PES_DISABLE | UNICOMMSPI_CTL1_PREN_ENABLE |
             UNICOMMSPI_CTL1_PTEN_ENABLE),
        /*! Disable receive and transmit parity  禁用校验 */
        DL_SPI_PARITY_NONE =
            (UNICOMMSPI_CTL1_PREN_DISABLE | UNICOMMSPI_CTL1_PTEN_DISABLE)
    } DL_SPI_PARITY;

    /*! @enum DL_SPI_FRAME_FORMAT  SPI 帧格式 */
    typedef enum
    {
        /*! Motorola 3 Wire with Polarity 0, Phase 0  Motorola 3 线，极性 0 相位 0 */
        DL_SPI_FRAME_FORMAT_MOTO3_POL0_PHA0 =
            (UNICOMMSPI_CTL0_SPO_LOW | UNICOMMSPI_CTL0_SPH_FIRST |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_3WIRE),
        /*! Motorola 3 Wire with Polarity 0, Phase 1  Motorola 3 线，极性 0 相位 1 */
        DL_SPI_FRAME_FORMAT_MOTO3_POL0_PHA1 =
            (UNICOMMSPI_CTL0_SPO_LOW | UNICOMMSPI_CTL0_SPH_SECOND |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_3WIRE),
        /*! Motorola 3 Wire with Polarity 1, Phase 0  Motorola 3 线，极性 1 相位 0 */
        DL_SPI_FRAME_FORMAT_MOTO3_POL1_PHA0 =
            (UNICOMMSPI_CTL0_SPO_HIGH | UNICOMMSPI_CTL0_SPH_FIRST |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_3WIRE),
        /*! Motorola 3 Wire with Polarity 1, Phase 1  Motorola 3 线，极性 1 相位 1 */
        DL_SPI_FRAME_FORMAT_MOTO3_POL1_PHA1 =
            (UNICOMMSPI_CTL0_SPO_HIGH | UNICOMMSPI_CTL0_SPH_SECOND |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_3WIRE),
        /*! Motorola 4 Wire with Polarity 0, Phase 0  Motorola 4 线，极性 0 相位 0 */
        DL_SPI_FRAME_FORMAT_MOTO4_POL0_PHA0 =
            (UNICOMMSPI_CTL0_SPO_LOW | UNICOMMSPI_CTL0_SPH_FIRST |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_4WIRE),
        /*! Motorola 4 Wire with Polarity 0, Phase 1  Motorola 4 线，极性 0 相位 1 */
        DL_SPI_FRAME_FORMAT_MOTO4_POL0_PHA1 =
            (UNICOMMSPI_CTL0_SPO_LOW | UNICOMMSPI_CTL0_SPH_SECOND |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_4WIRE),
        /*! Motorola 4 Wire with Polarity 1, Phase 0  Motorola 4 线，极性 1 相位 0 */
        DL_SPI_FRAME_FORMAT_MOTO4_POL1_PHA0 =
            (UNICOMMSPI_CTL0_SPO_HIGH | UNICOMMSPI_CTL0_SPH_FIRST |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_4WIRE),
        /*! Motorola 4 Wire with Polarity 1, Phase 1  Motorola 4 线，极性 1 相位 1 */
        DL_SPI_FRAME_FORMAT_MOTO4_POL1_PHA1 =
            (UNICOMMSPI_CTL0_SPO_HIGH | UNICOMMSPI_CTL0_SPH_SECOND |
             UNICOMMSPI_CTL0_FRF_MOTOROLA_4WIRE),
        /*! TI Sync Frame Format  TI 同步帧格式 */
        DL_SPI_FRAME_FORMAT_TI_SYNC = (UNICOMMSPI_CTL0_FRF_TI_SYNC),
    } DL_SPI_FRAME_FORMAT;

    /*! @enum DL_SPI_MODE  SPI 主从模式 */
    typedef enum
    {
        /*! Controller mode  主机模式 */
        DL_SPI_MODE_CONTROLLER = (UNICOMMSPI_CTL1_CP_ENABLE),
        /*! Peripheral mode  从机模式 */
        DL_SPI_MODE_PERIPHERAL = (UNICOMMSPI_CTL1_CP_DISABLE)
    } DL_SPI_MODE;

