zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
    /*! @enum DL_SPI_BIT_ORDER  SPI 位序 */
    typedef enum
    {
        /*! MSB First  高位优先 */
        DL_SPI_BIT_ORDER_MSB_FIRST = (UNICOMMSPI_CTL1_MSB_ENABLE),
        /*! LSB First  低位优先 */
        DL_SPI_BIT_ORDER_LSB_FIRST = (UNICOMMSPI_CTL1_MSB_DISABLE)
    } DL_SPI_BIT_ORDER;

    /*! @enum DL_SPI_DATA_SIZE  SPI 数据位宽 */
    typedef enum
    {
        /*! Data size 4 bits  数据宽度 4 位 */
        DL_SPI_DATA_SIZE_4 = (UNICOMMSPI_CTL0_DSS_DSS_4),
        /*! Data size 5 bits  数据宽度 5 位 */
        DL_SPI_DATA_SIZE_5 = (UNICOMMSPI_CTL0_DSS_DSS_5),
        /*! Data size 6 bits  数据宽度 6 位 */
        DL_SPI_DATA_SIZE_6 = (UNICOMMSPI_CTL0_DSS_DSS_6),
        /*! Data size 7 bits  数据宽度 7 位 */
        DL_SPI_DATA_SIZE_7 = (UNICOMMSPI_CTL0_DSS_DSS_7),
        /*! Data size 8 bits  数据宽度 8 位 */
        DL_SPI_DATA_SIZE_8 = (UNICOMMSPI_CTL0_DSS_DSS_8),
        /*! Data size 9 bits  数据宽度 9 位 */
        DL_SPI_DATA_SIZE_9 = (UNICOMMSPI_CTL0_DSS_DSS_9),
        /*! Data size 10 bits  数据宽度 10 位 */
        DL_SPI_DATA_SIZE_10 = (UNICOMMSPI_CTL0_DSS_DSS_10),
        /*! Data size 11 bits  数据宽度 11 位 */
        DL_SPI_DATA_SIZE_11 = (UNICOMMSPI_CTL0_DSS_DSS_11),
        /*! Data size 12 bits  数据宽度 12 位 */
        DL_SPI_DATA_SIZE_12 = (UNICOMMSPI_CTL0_DSS_DSS_12),
        /*! Data size 13 bits  数据宽度 13 位 */
        DL_SPI_DATA_SIZE_13 = (UNICOMMSPI_CTL0_DSS_DSS_13),
        /*! Data size 14 bits  数据宽度 14 位 */
        DL_SPI_DATA_SIZE_14 = (UNICOMMSPI_CTL0_DSS_DSS_14),
        /*! Data size 15 bits  数据宽度 15 位 */
        DL_SPI_DATA_SIZE_15 = (UNICOMMSPI_CTL0_DSS_DSS_15),
        /*! Data size 16 bits  数据宽度 16 位 */
        DL_SPI_DATA_SIZE_16 = (UNICOMMSPI_CTL0_DSS_DSS_16),
    } DL_SPI_DATA_SIZE;

    /*! @enum DL_SPI_CHIP_SELECT  SPI 片选引脚 */
    typedef enum
    {
        /*! Chip Select 0  片选 0 */
        DL_SPI_CHIP_SELECT_0 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_0),
        /*! Chip Select 1  片选 1 */
        DL_SPI_CHIP_SELECT_1 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_1),
        /*! Chip Select 2  片选 2 */
        DL_SPI_CHIP_SELECT_2 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_2),
        /*! Chip Select 3  片选 3 */
        DL_SPI_CHIP_SELECT_3 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_3),
        /*! No chip select  不使用片选 */
        DL_SPI_CHIP_SELECT_NONE = (0)
    } DL_SPI_CHIP_SELECT;

    /*! @enum DL_SPI_TX_FIFO_LEVEL  发送 FIFO 中断触发阈值 */
    typedef enum
    {
        /*! Interrupt triggers when TX FIFO <= 3/4 empty  TX FIFO 空 3/4 时触发 */
        DL_SPI_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_3_4,
        /*! Interrupt triggers when TX FIFO <= 1/2 empty (default)  TX FIFO 空 1/2 时触发（默认） */
        DL_SPI_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_2,
        /*! Interrupt triggers when TX FIFO <= 1/4 empty  TX FIFO 空 1/4 时触发 */
        DL_SPI_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_4,
        /*! Interrupt triggers when TX FIFO is not totally full  TX FIFO 未满时触发 */
        DL_SPI_TX_FIFO_LEVEL_ONE_FRAME = UNICOMMSPI_IFLS_TXIFLSEL_LVL_NOT_FULL,
        /*! Interrupt triggers when TX FIFO is empty  TX FIFO 完全空时触发 */
        DL_SPI_TX_FIFO_LEVEL_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_EMPTY,
        /*! Interrupt triggers when TX FIFO <= 1  TX FIFO 仅剩 1 个时触发 */
        DL_SPI_TX_FIFO_LEVEL_ALMOST_EMPTY =
            UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
        /*! Interrupt triggers when TX FIFO >= (MAX FIFO LEN) - 1  TX FIFO 差 1 满时触发 */
        DL_SPI_TX_FIFO_LEVEL_ALMOST_FULL =
            UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_FULL,
    } DL_SPI_TX_FIFO_LEVEL;

    /*! @enum DL_SPI_RX_FIFO_LEVEL  接收 FIFO 中断触发阈值 */
    typedef enum
    {
        /*! Interrupt triggers when RX FIFO >= 3/4 full  RX FIFO 满 3/4 时触发 */
        DL_SPI_RX_FIFO_LEVEL_3_4_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_3_4,
        /*! Interrupt triggers when RX FIFO >= 1/2 full (default)  RX FIFO 满 1/2 时触发（默认） */
        DL_SPI_RX_FIFO_LEVEL_1_2_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_2,
        /*! Interrupt triggers when RX FIFO >= 1/4 full  RX FIFO 满 1/4 时触发 */
        DL_SPI_RX_FIFO_LEVEL_1_4_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_4,
        /*! Interrupt triggers when RX FIFO is not empty  RX FIFO 非空时触发 */
        DL_SPI_RX_FIFO_LEVEL_ONE_FRAME = UNICOMMSPI_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
        /*! Interrupt triggers when RX FIFO is full  RX FIFO 完全满时触发 */
        DL_SPI_RX_FIFO_LEVEL_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_FULL,
        /*! Interrupt triggers when RX FIFO >= (MAX FIFO LEN) - 1  RX FIFO 差 1 满时触发 */
        DL_SPI_RX_FIFO_LEVEL_ALMOST_FULL =
            UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
        /*! Interrupt triggers when RX FIFO <= 1  RX FIFO 仅剩 1 个时触发 */
        DL_SPI_RX_FIFO_LEVEL_ALMOST_EMPTY =
            UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY,
    } DL_SPI_RX_FIFO_LEVEL;

    /*! @enum DL_SPI_IIDX  SPI 中断索引 */
    typedef enum
    {

        /*! SPI interrupt index for DMA Done 1 event for transmit  DMA 发送完成中断索引 */
        DL_SPI_IIDX_DMA_DONE_TX = UNICOMMSPI_IIDX_STAT_DMA_DONE_TX,
        /*! SPI interrupt index for DMA Done 1 event for receive  DMA 接收完成中断索引 */
        DL_SPI_IIDX_DMA_DONE_RX = UNICOMMSPI_IIDX_STAT_DMA_DONE_RX,
        /*! SPI interrupt index for SPI to signal it has finished transfers and
         * changed into idle mode  SPI 空闲中断索引 */

        DL_SPI_IIDX_IDLE = UNICOMMSPI_IIDX_STAT_IDLE_EVT,
        /*! SPI interrupt index for transmit FIFO empty  发送 FIFO 空中断索引 */
        DL_SPI_IIDX_TX_EMPTY = UNICOMMSPI_IIDX_STAT_TX_EMPTY,
        /*! SPI interrupt index for transmit FIFO  发送 FIFO 触发中断索引 */
        DL_SPI_IIDX_TX = UNICOMMSPI_IIDX_STAT_TX_EVT,
        /*! SPI interrupt index for receive FIFO  接收 FIFO 触发中断索引 */
        DL_SPI_IIDX_RX = UNICOMMSPI_IIDX_STAT_RX_EVT,
        /*! SPI interrupt index for receive timeout  接收超时中断索引 */
        DL_SPI_IIDX_RX_TIMEOUT = UNICOMMSPI_IIDX_STAT_RTOUT_EVT,

        /*! SPI interrupt index for receive FIFO full  接收 FIFO 满中断索引 */
        DL_SPI_IIDX_RX_FULL = UNICOMMSPI_IIDX_STAT_RXFULL_EVT,
        /*! SPI interrupt index for transmit FIFO underflow  发送 FIFO 下溢中断索引 */
        DL_SPI_IIDX_TX_UNDERFLOW = UNICOMMSPI_IIDX_STAT_TXFIFO_UNF_EVT,

