zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
        /*! SPI interrupt index for parity error  校验错误中断索引 */
        DL_SPI_IIDX_PARITY_ERROR = UNICOMMSPI_IIDX_STAT_PER_EVT,
        /*! SPI interrupt index for receive FIFO overflow  接收 FIFO 上溢中断索引 */
        DL_SPI_IIDX_RX_OVERFLOW = UNICOMMSPI_IIDX_STAT_RXFIFO_OFV_EVT,
        /*! SPI interrupt index for PREIRQ RX  DMA 接收预中断索引 */
        DL_SPI_IIDX_PREIRQ_RX = UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_RX,
        /*! SPI interrupt index for PREIRQ TX  DMA 发送预中断索引 */
        DL_SPI_IIDX_PREIRQ_TX = UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_TX,
        /*! SPI interrupt index for line time out  总线超时中断索引 */
        DL_SPI_IIDX_LTOUT = UNICOMMSPI_IIDX_STAT_LTOUT,
    } DL_SPI_IIDX;

    /*! @enum DL_SPI_CLOCK_DIVIDE_RATIO  SPI 时钟分频比 */
    typedef enum
    {
        /*! SPI source clock divide ratio set to 1  不分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_1 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_1,
        /*! SPI source clock divide ratio set to 2  2 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_2 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_2,
        /*! SPI source clock divide ratio set to 3  3 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_3 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_3,
        /*! SPI source clock divide ratio set to 4  4 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_4 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_4,
        /*! SPI source clock divide ratio set to 5  5 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_5 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_5,
        /*! SPI source clock divide ratio set to 6  6 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_6 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_6,
        /*! SPI source clock divide ratio set to 7  7 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_7 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_7,
        /*! SPI source clock divide ratio set to 8  8 分频 */
        DL_SPI_CLOCK_DIVIDE_RATIO_8 = UNICOMMSPI_CLKDIV_RATIO_DIV_BY_8
    } DL_SPI_CLOCK_DIVIDE_RATIO;

    /*! @enum DL_SPI_CLOCK  SPI 时钟源 */
    typedef enum
    {
        /*! Selects BUSCLK as the clock source  总线时钟 */
        DL_SPI_CLOCK_BUSCLK = UNICOMMSPI_CLKSEL_BUSCLK_SEL_ENABLE,
        /*! Selects MFCLK as the clock source  中频时钟 */
        DL_SPI_CLOCK_MFCLK = UNICOMMSPI_CLKSEL_MFCLK_SEL_ENABLE,
        /*! Selects LFCLK as the clock source  低频时钟 */
        DL_SPI_CLOCK_LFCLK = UNICOMMSPI_CLKSEL_LFCLK_SEL_ENABLE,
        /*! Selects ASYNC LFCLK as the clock source  异步低频时钟 */
        DL_SPI_CLOCK_ASYNC_LFCLK = UNICOMMSPI_CLKSEL_ASYNC_LFCLK_SEL_ENABLE,
        /*! Selects ASYNC SYSCLK as the clock source  异步系统时钟 */
        DL_SPI_CLOCK_ASYNC_SYSCLK = UNICOMMSPI_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE,
        /*! Selects ASYNC HFCLK as the clock source  异步高频时钟 */
        DL_SPI_CLOCK_ASYNC_HFCLK = UNICOMMSPI_CLKSEL_ASYNC_HFCLK_SEL_ENABLE,
        /*! Selects ASYNC PLL as the clock source  异步 PLL 时钟 */
        DL_SPI_CLOCK_ASYNC_PLL = UNICOMMSPI_CLKSEL_ASYNC_PLL_SEL_ENABLE
    } DL_SPI_CLOCK;

    /*!
     *  @brief  Configuration struct for @ref DL_SPI_init.
     *          SPI 初始化配置结构体
     */
    typedef struct
    {
        /*! The controller/peripheral mode configuration. One of @ref DL_SPI_MODE
         *  主从模式配置 */
        DL_SPI_MODE mode;

        /*!
         *  The frame format to use for data transfer. One of @ref
         *  DL_SPI_FRAME_FORMAT
         *  帧格式配置
         */
        DL_SPI_FRAME_FORMAT frameFormat;

        /*!
         *  The parity configuration to use for data transfer. One of @ref
         *  DL_SPI_PARITY.
         *  校验配置
         */
        DL_SPI_PARITY parity;

        /*! The size of the data transfer. One of @ref DL_SPI_DATA_SIZE
         *  数据位宽 */
        DL_SPI_DATA_SIZE dataSize;

        /*! The order of bits during data transfer. One of @ref DL_SPI_BIT_ORDER
         *  位序配置 */
        DL_SPI_BIT_ORDER bitOrder;

        /*! The pin to use for chip select. Used in Controller or Peripheral modes
         *  with Motorola 4-Wire or TI Sync frame formats. One of
         *  @ref DL_SPI_CHIP_SELECT.
         *  片选引脚配置
         */
        DL_SPI_CHIP_SELECT chipSelectPin;

    } DL_SPI_Config;

    /*!
     *  @brief  Configuration struct for @ref DL_SPI_setClockConfig.
     *          SPI 时钟配置结构体
     */
    typedef struct
    {
        /*! Selects SPI module clock source @ref DL_SPI_CLOCK
         *  SPI 时钟源选择 */
        DL_SPI_CLOCK clockSel;

        /*! Selects the divide ratio. One of @ref DL_SPI_CLOCK_DIVIDE_RATIO
         *  分频比选择 */
        DL_SPI_CLOCK_DIVIDE_RATIO divideRatio;

    } DL_SPI_ClockConfig;

    /**
     * @brief Configuration structure to backup SPI peripheral state before going
     *        to STOP/STANDBY mode. Not required after PG 1.0 silicon. Used by
     *        @ref DL_SPI_saveConfiguration and @ref DL_SPI_restoreConfiguration
     *        SPI 低功耗配置备份结构体，用于 STOP/STANDBY 前保存寄存器状态
     */
    typedef struct
    {
        /*! Combination of basic SPI control configurations that are
         *  compressed to a single word as they are stored in the SPI
         *  registers See @ref DL_SPI_init for how the peripheral control word 0
         *  is created.
         *  CTL0 寄存器备份（片选、帧格式、数据位宽等） */
        uint32_t controlWord0;

        /*! Combination of basic SPI control configurations that are
         *  compressed to a single word as they are stored in the SPI
         *  registers. See @ref DL_SPI_init for how the peripheral control word 1
         *  is created.
         *  CTL1 寄存器备份（校验、位序、主从模式等） */
        uint32_t controlWord1;

        /*! Combination of serial clock divider and delayed sampling settings
         *  compressed to a single word as they are stored in the SPI registers.
         *  CLKCTL 寄存器备份（串行时钟分频器与延迟采样） */
        uint32_t clockControl;

        /*! SPI module clock source. One of  @ref DL_SPI_CLOCK
         *  时钟源选择备份 */
        uint32_t clockSel;

        /*! SPI clock divider. One of @ref DL_SPI_CLOCK_DIVIDE_RATIO
         *  分频比备份 */
        uint32_t divideRatio;

        /*! Combination of SPI interrupt FIFO level select configurations that are
         *  compressed to a single word as they are stored in the SPI
         *  registers.
         *  IFLS 寄存器备份（FIFO 中断阈值） */
        uint32_t interruptFifoLevelSelectWord;

