zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
        /*! SPI interrupt status for EVENT0.
         *  Bitwise OR of @ref DL_SPI_INTERRUPT
         *  CPU 中断掩码备份 */
        uint32_t interruptMask0;

        /*! SPI interrupt status for EVENT1.
         *  Bitwise OR of @ref DL_SPI_DMA_INTERRUPT_RX
         *  DMA 接收触发中断掩码备份 */
        uint32_t interruptMask1;

        /*! SPI interrupt status for EVENT2.
         *  Bitwise OR of @ref DL_SPI_DMA_INTERRUPT_TX
         *  DMA 发送触发中断掩码备份 */
        uint32_t interruptMask2;

        /*! Boolean flag indicating whether or not a valid configuration structure
         *  exists. Should not be modified by the user.
         *  备份有效标志，用户不应修改 */
        bool backupRdy;
    } DL_SPI_backupConfig;

    /**
     *  @brief      Initialize the SPI peripheral
     *
     *  Initializes all the common configurable options for the SPI peripheral. Any
     *  other custom configuration can be done after calling this API. The SPI is
     *  not enabled in this API.
     *
     *  功能：初始化 SPI 常用配置项，不在本接口内使能 SPI。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config  Configuration for SPI peripheral
     *                      参数：SPI 初始化配置结构体。
     *  @return     返回值：无。
     */
    void DL_SPI_init(UNICOMM_Inst_Regs *unicomm, DL_SPI_Config *config);

    /**
     * @brief Enables power on SPI module  使能 SPI 模块电源
     *
     * @param unicomm        Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enablePower(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_enablePower(unicomm);
        if (unicomm->fixedMode == false)
        {
            DL_UNICOMM_setIPMode(unicomm, DL_UNICOMM_SPI);
        }
    }

    /**
     * @brief Disables power on spi module  关闭 SPI 模块电源
     *
     * @param unicomm        Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disablePower(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_disablePower(unicomm);
    }

    /**
     * @brief Returns if  power on spi module  查询 SPI 模块电源状态
     *
     * @param unicomm        Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     * @return true if power is enabled  电源已使能
     * @return false if power is disabled  电源已关闭
     */
    __STATIC_INLINE bool DL_SPI_isPowerEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return DL_UNICOMM_isPowerEnabled(unicomm);
    }

    /**
     * @brief Resets spi peripheral  复位 SPI 外设
     *
     * @param unicomm        Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_reset(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_reset(unicomm);
    }

    /**
     * @brief Returns if spi peripheral was reset  查询 SPI 外设是否完成复位
     *
     * @param unicomm        Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     * @return true if peripheral was reset  复位已完成
     * @return false if peripheral wasn't reset  复位未完成
     *
     */
    __STATIC_INLINE bool DL_SPI_isReset(UNICOMM_Inst_Regs *unicomm)
    {
        return DL_UNICOMM_isReset(unicomm);
    }

    /**
     *  @brief      Enable the SPI peripheral  使能 SPI 外设
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enable(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_ENABLE_ENABLE;
    }

    /**
     *  @brief      Checks if the SPI peripheral is enabled  查询 SPI 外设是否已使能
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the enabled status of the SPI
     *              返回值：SPI 使能状态。
     *
     *  @retval     true  The SPI peripheral is enabled  已使能
     *  @retval     false The SPI peripheral is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_ENABLE_MASK) ==
                UNICOMMSPI_CTL1_ENABLE_ENABLE);
    }

    /**
     *  @brief      Disable the SPI peripheral  禁用 SPI 外设
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disable(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_ENABLE_MASK);
    }

    /**
     *  @brief      Configure SPI source clock
     *
     *  @param[in]  unicomm    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                       @ref DL_SPI_ClockConfig.
     *                       参数：SPI 时钟配置结构体。
     *  @return     返回值：无。
     * @details    功能：参见上方英文说明。
     */
    void DL_SPI_setClockConfig(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_ClockConfig *config);

    /**
     *  @brief      Get SPI source clock configuration
     *
     *  @param[in]  unicomm    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                      @ref DL_SPI_ClockConfig.
     *                      参数：用于回填的 SPI 时钟配置结构体。
     *  @return     返回值：无。
     * @details    功能：参见上方英文说明。
     */
    void DL_SPI_getClockConfig(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_ClockConfig *config);

    /**
     *  @brief      Checks if the SPI is busy transmitting  查询 SPI 是否正在传输
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the busy status of the SPI
     *              返回值：SPI 忙碌状态。
     *
     *  @retval     true  The SPI is transmitting  正在传输
     *  @retval     false The SPI is idle  空闲
     */
    __STATIC_INLINE bool DL_SPI_isBusy(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_BUSY_MASK) ==
                UNICOMMSPI_STAT_BUSY_ACTIVE);
    }

    /**
     *  @brief      Checks if the TX FIFO is empty  查询发送 FIFO 是否为空
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the empty status of the TX FIFO
     *              返回值：TX FIFO 空状态。
     *
     *  @retval     true  The TX FIFO is empty  发送 FIFO 为空
     *  @retval     false The TX FIFO is not empty  发送 FIFO 非空
     */
    __STATIC_INLINE bool DL_SPI_isTXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_TXFE_MASK) ==
                UNICOMMSPI_STAT_TXFE_EMPTY);
    }

    /**
     *  @brief      Checks if the TX FIFO is full  查询发送 FIFO 是否已满
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the full status of the TX FIFO
     *              返回值：TX FIFO 满状态。
     *
     *  @retval     true  The TX FIFO is full  发送 FIFO 已满
     *  @retval     false The TX FIFO is not full  发送 FIFO 未满
     */
    __STATIC_INLINE bool DL_SPI_isTXFIFOFull(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_TXFF_MASK) ==
                UNICOMMSPI_STAT_TXFF_SET);
    }

    /**
     *  @brief      Checks if the RX FIFO is empty  查询接收 FIFO 是否为空
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the empty status of the RX FIFO
     *              返回值：RX FIFO 空状态。
     *
     *  @retval     true  The RX FIFO is empty  接收 FIFO 为空
     *  @retval     false The RX FIFO is not empty  接收 FIFO 非空
     */
    __STATIC_INLINE bool DL_SPI_isRXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_RXFE_MASK) ==
                UNICOMMSPI_STAT_RXFE_EMPTY);
    }

    /**
     *  @brief      Checks if the RX FIFO is full  查询接收 FIFO 是否已满
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns the full status of the RX FIFO
     *              返回值：RX FIFO 满状态。
     *
     *  @retval     true  The RX FIFO is full  接收 FIFO 已满
     *  @retval     false The RX FIFO is not full  接收 FIFO 未满
     */
    __STATIC_INLINE bool DL_SPI_isRXFIFOFull(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_RXFF_MASK) ==
                UNICOMMSPI_STAT_RXFF_SET);
    }

    /**
     *  @brief      Checks if the TX FIFO is cleared  查询发送 FIFO 是否已清除
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns TX FIFO clear status
     *              返回值：TX FIFO 清除状态。
     *
     *  @retval     true  The TX FIFO is cleared  发送 FIFO 已清除
     *  @retval     false The TX FIFO is not cleared  发送 FIFO 未清除
     */

    __STATIC_INLINE bool DL_SPI_isTXFIFOCleared(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_TXCLR_MASK) ==
                UNICOMMSPI_STAT_TXCLR_SET);
    }

    /**
     *  @brief      Checks if the RX FIFO is cleared  查询接收 FIFO 是否已清除
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Returns RX FIFO clear status
     *              返回值：RX FIFO 清除状态。
     *
     *  @retval     true  The RX FIFO is cleared  接收 FIFO 已清除
     *  @retval     false The RX FIFO is not cleared  接收 FIFO 未清除
     */

