zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
    __STATIC_INLINE bool DL_SPI_isRXFIFOCleared(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_RXCLR_MASK) ==
                UNICOMMSPI_STAT_RXCLR_SET);
    }

    /**
     *  @brief      returns current cdmode value  获取当前命令/数据模式值
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     returns current cdmode value
     *              返回值：当前 CDMODE 值。
     */
    __STATIC_INLINE uint32_t DL_SPI_getCurrentCDMODEValue(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->STAT & UNICOMMSPI_STAT_CDMODE_MASK) >>
                UNICOMMSPI_STAT_CDMODE_OFS);
    }

    /**
     *  @brief      Sets the parity configuration used for transactions
     *              设置收发校验模式
     *
     *  This API sets the configuration for both receive parity and transmit parity.
     *  This includes which bit is used, and whether even or odd parity is set.
     *
     *  To individually enable or dsiable the receive or transmit parity, refer to
     *  the APIs listed below.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  parity  Parity configuration to use. One of @ref DL_SPI_PARITY.
     *                      参数：校验模式配置。
     *
     *  @sa         DL_SPI_init
     *  @sa         DL_SPI_enableReceiveParity
     *  @sa         DL_SPI_disableReceiveParity
     *  @sa         DL_SPI_enableTransmitParity
     *  @sa         DL_SPI_disableTransmitParity
     */
    __STATIC_INLINE void DL_SPI_setParity(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_PARITY parity)
    {
        DL_Common_updateReg(&unicomm->spi->CTL1, (uint32_t)parity,
                            (UNICOMMSPI_CTL1_PREN_MASK | UNICOMMSPI_CTL1_PTEN_MASK |
                             UNICOMMSPI_CTL1_PES_MASK));
    }

    /**
     *  @brief      Get the current receive and transmit parity configuration
     *              获取当前收发校验配置
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current parity configuration being used
     *              返回值：当前校验配置。
     *
     *  @retval     One of @ref DL_SPI_PARITY
     */
    __STATIC_INLINE DL_SPI_PARITY DL_SPI_getParity(UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t parity = unicomm->spi->CTL1 &
                          (UNICOMMSPI_CTL1_PES_MASK | UNICOMMSPI_CTL1_PREN_MASK |
                           UNICOMMSPI_CTL1_PTEN_MASK);

        return (DL_SPI_PARITY)(parity);
    }

    /**
     *  @brief      Enables receive parity  使能接收校验
     *
     *  This API only enables receive parity, it does not configure the parity mode
     *  used.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_SPI_setParity
     */
    __STATIC_INLINE void DL_SPI_enableReceiveParity(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_PREN_ENABLE;
    }

    /**
     *  @brief      Disables receive parity  禁用接收校验
     *
     *  This API only disable receive parity, it does not configure the parity mode
     *  used.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_SPI_setParity
     */
    __STATIC_INLINE void DL_SPI_disableReceiveParity(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_PREN_MASK);
    }

    /**
     *  @brief      Checks if receive parity is enabled  查询接收校验是否已使能
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If receive parity is enabled
     *              返回值：接收校验使能状态。
     *
     *  @retval     true   Receive parity is enabled  已使能
     *  @retval     false  Receive parity is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isReceiveParityEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_PREN_MASK) ==
                UNICOMMSPI_CTL1_PREN_ENABLE);
    }

    /**
     *  @brief      Enables transmit parity  使能发送校验
     *
     *  This API only enables transmit parity, it does not configure the parity mode
     *  used.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_SPI_setParity
     */
    __STATIC_INLINE void DL_SPI_enableTransmitParity(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_PTEN_ENABLE;
    }

    /**
     *  @brief      Disables transmit parity  禁用发送校验
     *
     *  This API only disables transmit parity, it does not configure the parity
     *  mode used.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_SPI_setParity
     */
    __STATIC_INLINE void DL_SPI_disableTransmitParity(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_PTEN_MASK);
    }

    /**
     *  @brief      Checks if transmit parity is enabled  查询发送校验是否已使能
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If transmit parity is enabled
     *              返回值：发送校验使能状态。
     *
     *  @retval     true   Transmit parity is enabled  已使能
     *  @retval     false  Transmit parity is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isTransmitParityEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_PTEN_MASK) ==
                UNICOMMSPI_CTL1_PTEN_ENABLE);
    }

    /**
     *  @brief      Set the frame format to use  设置帧格式
     *
     *  Configures the frame format to use for transactions. If you are using chip
     *  select you must use one of the Motorola 4 wire frame formats.
     *
     *  @param[in]  unicomm          Pointer to the register overlay for the peripheral
     *                               参数：UNICOMM 外设寄存器实例。
     *  @param[in]  frameFormat  Frame format to use. One of @ref
     *                           DL_SPI_FRAME_FORMAT.
     *                           参数：帧格式。
     *
     *  @sa         DL_SPI_init
     */
    __STATIC_INLINE void DL_SPI_setFrameFormat(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_FRAME_FORMAT frameFormat)
    {
        DL_Common_updateReg(&unicomm->spi->CTL0, (uint32_t)frameFormat,
                            (UNICOMMSPI_CTL0_FRF_MASK | UNICOMMSPI_CTL0_SPO_MASK |
                             UNICOMMSPI_CTL0_SPH_MASK));
    }

    /**
     *  @brief      Get the frame format configuration  获取当前帧格式配置
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current frame format being used
     *              返回值：当前帧格式。
     *
     *  @retval     One of @ref DL_SPI_FRAME_FORMAT
     */
    __STATIC_INLINE DL_SPI_FRAME_FORMAT DL_SPI_getFrameFormat(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t frameFormat = unicomm->spi->CTL0 & (UNICOMMSPI_CTL0_FRF_MASK |
                                                     UNICOMMSPI_CTL0_SPO_MASK |
                                                     UNICOMMSPI_CTL0_SPH_MASK);

