zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
        return (DL_SPI_FRAME_FORMAT)(frameFormat);
    }

    /**
     *  @brief      Set the size for transfers  设置传输数据位宽
     *
     *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
     *                            参数：UNICOMM 外设寄存器实例。
     *  @param[in]  dataSize  Number of bits used in a transfer.
     *                        One of @ref DL_SPI_DATA_SIZE
     *                        参数：数据位宽。
     *
     *  @sa         DL_SPI_init
     */
    __STATIC_INLINE void DL_SPI_setDataSize(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_DATA_SIZE dataSize)
    {
        DL_Common_updateReg(
            &unicomm->spi->CTL0, (uint32_t)dataSize, UNICOMMSPI_CTL0_DSS_MASK);
    }

    /**
     *  @brief      Get the configured size for transfers  获取当前数据位宽
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The currently configured size for transfers
     *              返回值：当前数据位宽。
     *
     *  @retval     One of @ref DL_SPI_DATA_SIZE
     */
    __STATIC_INLINE DL_SPI_DATA_SIZE DL_SPI_getDataSize(UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t dataSize = unicomm->spi->CTL0 & UNICOMMSPI_CTL0_DSS_MASK;

        return (DL_SPI_DATA_SIZE)(dataSize);
    }

    /**
     *  @brief      Set whether the device should be in controller/peripheral mode
     *              设置主从模式
     *
     *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  mode  Mode to configure the SPI into. One of @ref DL_SPI_MODE.
     *                    参数：主从模式。
     *
     *  @sa         DL_SPI_init
     */
    __STATIC_INLINE void DL_SPI_setMode(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_MODE mode)
    {
        DL_Common_updateReg(
            &unicomm->spi->CTL1, (uint32_t)mode, UNICOMMSPI_CTL1_CP_MASK);
    }

    /**
     *  @brief      Get the current mode for the SPI (controller/peripheral)
     *              获取当前主从模式
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The currently configured mode for the SPI (controller/peripheral)
     *              返回值：当前主从模式。
     *
     *  @retval     One of @ref DL_SPI_MODE.
     */
    __STATIC_INLINE DL_SPI_MODE DL_SPI_getMode(UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t mode = unicomm->spi->CTL1 & UNICOMMSPI_CTL1_CP_MASK;

        return (DL_SPI_MODE)(mode);
    }

    /**
     *  @brief      Set the bit order used for transfers  设置传输位序
     *
     *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
     *                            参数：UNICOMM 外设寄存器实例。
     *  @param[in]  bitOrder  Order for bits to be sent out during transfer. One of
     *                        @ref DL_SPI_BIT_ORDER.
     *                        参数：位序（MSB/LSB 优先）。
     *
     *  @sa         DL_SPI_init
     */
    __STATIC_INLINE void DL_SPI_setBitOrder(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_BIT_ORDER bitOrder)
    {
        DL_Common_updateReg(
            &unicomm->spi->CTL1, (uint32_t)bitOrder, UNICOMMSPI_CTL1_MSB_MASK);
    }

    /**
     *  @brief      Get the current bit order used for transfers  获取当前传输位序
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The currently configured bit order
     *              返回值：当前位序。
     *
     *  @retval     One of @ref DL_SPI_BIT_ORDER.
     */
    __STATIC_INLINE DL_SPI_BIT_ORDER DL_SPI_getBitOrder(UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t bitOrder = unicomm->spi->CTL1 & UNICOMMSPI_CTL1_MSB_MASK;

        return (DL_SPI_BIT_ORDER)(bitOrder);
    }

    /**
     *  @brief      Enables loopback mode  使能回环模式
     *
     *  Enables the loopback mode. When enabled, the output of the transmit serial
     *  shifter is connected to the input of the receive serial shifter internally.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enableLoopbackMode(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_LBM_ENABLE;
    }

    /**
     *  @brief      Disables loopback mode  禁用回环模式
     *
     *  Disables the loopback mode. When disabled, the transmit serial shifter and
     *  receive serial shifter are not connected internally.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disableLoopbackMode(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_LBM_MASK);
    }

    /**
     *  @brief      Checks if the loopback mode is enabled  查询回环模式是否已使能
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The status of the loopback mode
     *              返回值：回环模式状态。
     *
     *  @retval     true if loopback mode is enabled  已使能
     *  @retval     false if loopback mode is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isLoopbackModeEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_LBM_MASK) ==
                UNICOMMSPI_CTL1_LBM_ENABLE);
    }

    /**
     *  @brief      Set counter for repeated transmit  设置重复发送计数
     *
     *  Repeated transmit allows you to send the same data multiple times. This is
     *  essentially the same as writing the data into the transmit buffer
     *  repeatedly.
     *
     *  @param[in]  unicomm         pointer to the register overlay for the peripheral
     *                              参数：UNICOMM 外设寄存器实例。
     *  @param[in]  numRepeats  number of times to repeat the transfer. Should be a
     *                          value between 0-255.
     *                          @arg 0 disables the repeated transfer
     *                          @arg 1-255 repeats that many times. So will be sent
     *                               numRepeats + 1 times in total.
     *                          参数：重复次数（0-255），0 表示禁用。
     */
    __STATIC_INLINE void DL_SPI_setRepeatTransmit(
        UNICOMM_Inst_Regs *unicomm, uint32_t numRepeats)
    {
        DL_Common_updateReg(&unicomm->spi->CTL1,
                            numRepeats << UNICOMMSPI_CTL1_REPEATTX_OFS,
                            UNICOMMSPI_CTL1_REPEATTX_MASK);
    }

    /**
     *  @brief      Get counter for repeated transmit  获取重复发送计数
     *
     *  Repeated transmit allows you to send the same data multiple times. This is
     *  essentially the same as writing the data into the transmit buffer
     *  repeatedly.
     *
     *  @param[in]  unicomm    pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Number of repeats used for transfer
     *              返回值：重复发送次数。
     *
     *  @retval     0      Repeated transfer is disabled  禁用重复传输
     *  @retval     1-255  Repeat that many times.  重复次数
     */
    __STATIC_INLINE uint32_t DL_SPI_getRepeatTransmit(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_REPEATTX_MASK) >>
                UNICOMMSPI_CTL1_REPEATTX_OFS);
    }

    /**
     *  @brief      Enables data alignment on chip select for peripherals
     *              使能从机片选数据对齐
     *
     *  When enabled, the receieve bit counter is cleared automatically when the
     *  chip select gets set inactive. This helps the peripheral synchronize again to
     *  the controller in case of a disturbance or glitch on the clock line or during
     *  initialization.
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enablePeripheralAlignDataOnChipSelect(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL0 |= UNICOMMSPI_CTL0_CSCLR_ENABLE;
    }

    /**
     *  @brief      Disables data alignment on chip select for peripherals
     *              禁用从机片选数据对齐
     *
     *  When disable, the receieve bit counter is not cleared automatically when
     *  the chip select gets set inactive.
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disablePeripheralAlignDataOnChipSelect(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL0 &= ~(UNICOMMSPI_CTL0_CSCLR_MASK);
    }

    /**
     *  @brief      Checks if data alignment on chip select for peripherals is enabled
     *              查询从机片选数据对齐是否已使能
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The status of data alignment on chip select
     *              返回值：片选数据对齐状态。
     *
     *  @retval     true   Data alignment on chip select is enabled  已使能
     *  @retval     false  Data alignment on chip select is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isPeripheralAlignDataOnChipSelectEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL0 & UNICOMMSPI_CTL0_CSCLR_MASK) ==
                UNICOMMSPI_CTL0_CSCLR_ENABLE);
    }

    /**
     *  @brief      Set chip select used for controller or peripheral mode
     *              设置片选引脚
     *
     *  Choose which chip select should be used for data transfer. User must ensure
     *  one of the 4-wire frame formats were selected using @ref DL_SPI_init or
     *  @ref DL_SPI_setFrameFormat.
     *
     * This API is for both controller and peripheral modes, and the chip select
     * can be changed in the application by calling this API.
     *
     *  @param[in]  unicomm         pointer to the register overlay for the peripheral
     *                              参数：UNICOMM 外设寄存器实例。
     *  @param[in]  chipSelect  the chip select pin to use. One of @ref
     *                          DL_SPI_CHIP_SELECT.
     *                          参数：片选引脚。
     */
    __STATIC_INLINE void DL_SPI_setChipSelect(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_CHIP_SELECT chipSelect)
    {
        DL_Common_updateReg(&unicomm->spi->CTL0, (uint32_t)chipSelect,
                            UNICOMMSPI_CTL0_CSSEL_MASK);
    }

    /**
     *  @brief      Get chip select used for controller or peripheral mode
     *              获取当前片选引脚
     *
     *  This API is for both controller and peripheral modes.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current chip selected used for data transfer
     *              返回值：当前片选引脚。
     *
     *  @retval     One of @ref DL_SPI_CHIP_SELECT.
     */
    __STATIC_INLINE DL_SPI_CHIP_SELECT DL_SPI_getChipSelect(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t chipSelect = unicomm->spi->CTL0 & UNICOMMSPI_CTL0_CSSEL_MASK;

        return (DL_SPI_CHIP_SELECT)(chipSelect);
    }

    /**
     *  @brief      Set peripheral receive timeout  设置从机接收超时
     *
     *  Sets the number of clock cycles before a receive timeout occurs.
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm      pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     *  @param[in]  timeout  Number of clock cycles before a receive timeout
     *                       occurs. Must be between 0-63.
     *                       @arg 0 Disables receive timeout
     *                       @arg 1-63 Number of clock cycles before timeout
     *                       参数：超时周期数（0-63），0 禁用。
     */
    __STATIC_INLINE void DL_SPI_setPeripheralReceiveTimeout(
        UNICOMM_Inst_Regs *unicomm, uint32_t timeout)
    {
        DL_Common_updateReg(&unicomm->spi->CTL1,
                            timeout << UNICOMMSPI_CTL1_RXTIMEOUT_OFS,
                            UNICOMMSPI_CTL1_RXTIMEOUT_MASK);
    }

    /**
     *  @brief      Get peripheral receive timeout  获取从机接收超时配置
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current amount of cycles used for a peripheral timeout
     *              返回值：超时周期数。
     *
     *  @retval     0     indicating that receive timeout is disabled  超时已禁用
     *  @retval     1-63  number of clock cycles before a receive timeout occurs  超时周期数
     */
    __STATIC_INLINE uint32_t DL_SPI_getPeripheralReceiveTimeout(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_RXTIMEOUT_MASK) >>
                UNICOMMSPI_CTL1_RXTIMEOUT_OFS);
    }

    /**
     *  @brief      Configure the command/data mode  配置命令/数据模式
     *
     *  Command/data mode allows the hardware to control the C/D pin to indicate
     *  whether the data being transferred is a command or just data. The C/D pin
     *  is low for commands and high for data.
     *
     *  You can use this API to manually set the C/D pin by passing in @ref
     *  DL_SPI_CD_MODE_DATA or @ref DL_SPI_CD_MODE_COMMAND. You can also have the
     *  C/D pin switch automatically by passing in how many bytes are part of the
     *  command transfer. The C/D pin will stay low until that many bytes are sent
     *  out and then automatically switch to high.
     *
     *  This is only relevant when in controller mode.
     *
     *  @param[in]  unicomm    pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config configuration for command/data mode. One of:
     *                     @arg DL_SPI_CD_MODE_DATA
     *                     @arg DL_SPI_CD_MODE_COMMAND
     *                     @arg A value between 1-14 to indicate how many bytes
     *                          should be sent as command
     *                     参数：CD 模式配置。
     */
    __STATIC_INLINE void DL_SPI_setControllerCommandDataModeConfig(
        UNICOMM_Inst_Regs *unicomm, uint32_t config)
    {
        DL_Common_updateReg(&unicomm->spi->CTL1,
                            config << UNICOMMSPI_CTL1_CDMODE_OFS, UNICOMMSPI_CTL1_CDMODE_MASK);
    }

    /**
     *  @brief      Get the command/data mode configuration  获取命令/数据模式配置
     *
     *  Returns the current configuration for command/data mode. When using the
     *  automatic C/D pin the value read back will be the number of command bytes
     *  remaining to be sent.
     *
     *  @param[in]  unicomm    pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current configuration for command/data mode
     *              返回值：当前 CD 模式配置。
     *
     *  @retval     DL_SPI_CD_MODE_DATA    if in manual data mode  数据模式
     *  @retval     DL_SPI_CD_MODE_COMMAND if in manual command mode  命令模式
     *  @retval     1-14 indicating how many command bytes still need to be sent  剩余命令字节数
     */
    __STATIC_INLINE uint32_t DL_SPI_getControllerCommandDataModeConfig(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_CDMODE_MASK) >>
                UNICOMMSPI_CTL1_CDMODE_OFS);
    }

    /**
     *  @brief      Enables command/data mode  使能命令/数据模式
     *
     *  When command/data mode is enabled, the C/D pin is used to differentiate
     *  between command and data during the transaction.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_SPI_setControllerCommandDataModeConfig
     */
    __STATIC_INLINE void DL_SPI_enableControllerCommandDataMode(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_CDENABLE_ENABLE;
    }

    /**
     *  @brief      Disables command/data mode  禁用命令/数据模式
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disableControllerCommandDataMode(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_CDENABLE_MASK);
    }

    /**
     *  @brief      Checks if command/data mode is enabled  查询命令/数据模式是否已使能
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The status of command/data mode
     *              返回值：CD 模式使能状态。
     *
     *  @retval     true  Command/data mode is enabled  已使能
     *  @retval     false Command/data mode is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isControllerCommandDataModeEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_CDENABLE_MASK) ==
                UNICOMMSPI_CTL1_CDENABLE_ENABLE);
    }

    /**
     *  @brief      Enables peripheral data output  使能从机数据输出
     *
     *  When peripheral data output is enabled, the peripheral can drive the POCI output pin.
     *  This will cause problems if all peripherals have their RXD lines tied together
     *  and the controller is trying to broadcast a message to all peripherals while
     *  ensuring only one peripheral drives data onto its serial output line.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enablePeripheralDataOutput(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_POD_MASK);
    }

    /**
     *  @brief      Disables peripheral data output  禁用从机数据输出
     *
     *  When peripheral data output is disabled, the peripheral cannot drive the POCI output
     *  pin. This allows multiple peripherals that have their RXD lines tied together to
     *  receive a broadcasted message from a controller.
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disablePeripheralDataOutput(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_POD_ENABLE;
    }

    /**
     *  @brief      Checks if peripheral data output is enabled  查询从机数据输出是否已使能
     *
     *  This is only relevant when in peripheral mode.
     *
     *  @param[in]  unicomm  pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If peripheral data output is enabled
     *              返回值：从机数据输出状态。
     *
     *  @retval     true if peripheral data output is enabled  已使能
     *  @retval     false if peripheral data output is disabled  已禁用
     */
    __STATIC_INLINE bool DL_SPI_isPeripheralDataOutputEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CTL1 & UNICOMMSPI_CTL1_POD_MASK) ==
                UNICOMMSPI_CTL1_POD_DISABLE);
    }

    /**
     *  @brief      Set the delay sampling  设置延迟采样
     *
     *  In controller mode only, the data on the input pin will be delayed sampled
     *  by the defined SPI clock cycles. The delay can be adjusted in steps of SPI
     *  input clock steps. The maximum allowed delay should not exceed the length
     *  of one data frame
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  delay   The number of SPI clock cycles to delay sampling on
     *                      input pin. Value between 0-15.
     *                      参数：延迟采样周期数（0-15）。
     */
    __STATIC_INLINE void DL_SPI_setDelayedSampling(
        UNICOMM_Inst_Regs *unicomm, uint32_t delay)
    {
        DL_Common_updateReg(&unicomm->spi->CLKCTL,
                            delay << UNICOMMSPI_CLKCTL_DSAMPLE_OFS,
                            UNICOMMSPI_CLKCTL_DSAMPLE_MASK);
    }

    /**
     *  @brief      Get the delay sampling  获取延迟采样配置
     *
     *  In controller mode only, the data on the input pin will be delayed sampled
     *  by the defined SPI clock cycles. The delay can be adjusted in steps of SPI
     *  input clock steps. The maximum allowed delay should not exceed the length
     *  of one data frame
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The amount of delay sampling on the input pin in SPI
     *              clock cycles.
     *              返回值：延迟采样周期数。
     *
     *  @retval     0 - 15. The amount of delay sampling in SPI clock cycles.
     */
    __STATIC_INLINE uint32_t DL_SPI_getDelayedSampling(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->spi->CLKCTL & UNICOMMSPI_CLKCTL_DSAMPLE_MASK) >>
                UNICOMMSPI_CLKCTL_DSAMPLE_OFS);
    }

    /**
     *  @brief      Set the RX and TX FIFO interrupt threshold level
     *              设置收发 FIFO 中断阈值
     *
     *  Select the threshold for the receive and transmit FIFO interrupts. The
     *  interrupts are generated based on a transition through a level rather
     *  than being based on the level. That is, the interrupts are generated when
     *  the fill level progresses through the trigger level.
     *
     *  For example, if the trigger level is set to the half-way mark, the interrupt
     *  is triggered when the FIFO becomes half empty/full.
     *
     *  Out of reset, the FIFOs are triggered to interrupt at half-way mark.
     *
     *  @param[in]  unicomm             Pointer to the register overlay for the peripheral
     *                                  参数：UNICOMM 外设寄存器实例。
     *  @param[in]  rxThreshold     One of @ref DL_SPI_RX_FIFO_LEVEL
     *                              参数：RX FIFO 中断阈值。
     *  @param[in]  txThreshold     One of @ref DL_SPI_TX_FIFO_LEVEL
     *                              参数：TX FIFO 中断阈值。
     *
     */
    __STATIC_INLINE void DL_SPI_setFIFOThreshold(UNICOMM_Inst_Regs *unicomm,
                                                 DL_SPI_RX_FIFO_LEVEL rxThreshold, DL_SPI_TX_FIFO_LEVEL txThreshold)
    {
        DL_Common_updateReg(&unicomm->spi->IFLS,
                            (uint32_t)rxThreshold | (uint32_t)txThreshold,
                            UNICOMMSPI_IFLS_RXIFLSEL_MASK | UNICOMMSPI_IFLS_TXIFLSEL_MASK);
    }

    /**
     *  @brief      Get the TX FIFO interrupt threshold level  获取发送 FIFO 中断阈值
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The TX FIFO interrupt threshold level
     *              返回值：TX FIFO 中断阈值。
     *
     *  @retval     One of @ref DL_SPI_TX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_SPI_TX_FIFO_LEVEL DL_SPI_getTXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t txThreshold = unicomm->spi->IFLS & UNICOMMSPI_IFLS_TXIFLSEL_MASK;

