zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
        return (DL_SPI_TX_FIFO_LEVEL)(txThreshold);
    }

    /**
     *  @brief      Get the RX FIFO interrupt threshold level  获取接收 FIFO 中断阈值
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The RX FIFO interrupt threshold level
     *              返回值：RX FIFO 中断阈值。
     *
     *  @retval     One of @ref DL_SPI_RX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_SPI_RX_FIFO_LEVEL DL_SPI_getRXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t rxThreshold = unicomm->spi->IFLS & UNICOMMSPI_IFLS_RXIFLSEL_MASK;

        return (DL_SPI_RX_FIFO_LEVEL)(rxThreshold);
    }

    /**
     *  @brief      Flushes/removes all elements in the TX FIFO  清空发送 FIFO
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_flushTXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        DL_Common_updateReg(&unicomm->spi->IFLS,
                            (uint32_t)UNICOMMSPI_IFLS_TXCLR_ENABLE, UNICOMMSPI_IFLS_TXCLR_MASK);
    }

    /**
     *  @brief      Flushes/removes all elements in the RX FIFO  清空接收 FIFO
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_flushRXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        DL_Common_updateReg(&unicomm->spi->IFLS,
                            (uint32_t)UNICOMMSPI_IFLS_RXCLR_ENABLE, UNICOMMSPI_IFLS_RXCLR_MASK);
    }

    /**
     *  @brief      Set the SPI bit rate serial clock divider (SCR)
     *              设置 SPI 串行时钟分频器（SCR）
     *
     * The SPI includes a programmable bit rate clock divider and prescaler to
     * generate the serial output clock. The bit rates are supported up to
     * FUNCCLK/2. The functional clock selection depends on the specific device,
     * please refer to the device datasheet and PMU/Clock section.
     *
     * The SPI output bit rate is calculated with the following formula:
     * SPI bit rate = (SPI functional clock) / ((1 + SCR)*2)
     * Given this formula, the SCR can be calculated:
     * SCR = (SPI functional clock) / ((2 * SPI bit rate) - 1)
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *  @param[in]  SCR  The SPI serial clock divider. Value between 0-1023.
     *                   参数：串行时钟分频器值（0-1023）。
     */
    __STATIC_INLINE void DL_SPI_setBitRateSerialClockDivider(
        UNICOMM_Inst_Regs *unicomm, uint32_t SCR)
    {
        DL_Common_updateReg(
            &unicomm->spi->CLKCTL, SCR, UNICOMMSPI_CLKCTL_SCR_MASK);
    }

    /**
     *  @brief      Get the SPI bit rate serial clock divider (SCR)
     *              获取 SPI 串行时钟分频器值
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current bit rate serial clock divider
     *              返回值：当前 SCR 值。
     *
     *  @retval     The SPI SCR. Value from 0-1023
     */
    __STATIC_INLINE uint32_t DL_SPI_getBitRateSerialClockDivider(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->spi->CLKCTL & UNICOMMSPI_CLKCTL_SCR_MASK);
    }

    /**
     *  @brief      Writes 8-bit data into the TX FIFO for transmit
     *              写入 8 位数据到发送 FIFO（不检查状态）
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 8 位数据。
     *
     *  @sa         DL_SPI_transmitDataBlocking8
     *  @sa         DL_SPI_transmitDataCheck8
     */
    __STATIC_INLINE void DL_SPI_transmitData8(
        UNICOMM_Inst_Regs *unicomm, uint8_t data)
    {
        unicomm->spi->TXDATA = data;
    }

    /**
     *  @brief      Writes 16-bit data into the TX FIFO for transmit
     *              写入 16 位数据到发送 FIFO（不检查状态）
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 16 位数据。
     *
     *  @sa         DL_SPI_transmitDataBlocking16
     *  @sa         DL_SPI_transmitDataCheck16
     */
    __STATIC_INLINE void DL_SPI_transmitData16(
        UNICOMM_Inst_Regs *unicomm, uint16_t data)
    {
        unicomm->spi->TXDATA = data;
    }

    /**
     *  @brief      Writes 32-bit data into the TX FIFO for transmit
     *              写入 32 位数据到发送 FIFO（不检查状态）
     *
     *  Puts the data into the TX FIFO without checking its status. Use if already
     *  sure the TX FIFO has space for the write. See related APIs for additional
     *  transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 32 位数据。
     *
     *  @sa         DL_SPI_transmitDataBlocking32
     *  @sa         DL_SPI_transmitDataCheck32
     */
    __STATIC_INLINE void DL_SPI_transmitData32(
        UNICOMM_Inst_Regs *unicomm, uint32_t data)
    {
        unicomm->spi->TXDATA = data;
    }

    /**
     *  @brief      Reads 8-bit data from the RX FIFO
     *              从接收 FIFO 读取 8 位数据（不检查状态）
     *
     *  Reads the data from the RX FIFO without checking its status. Use if
     *  already sure the RX FIFO has data available. See related APIs for
     *  additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 8 位数据。
     *
     *  @sa         DL_SPI_receiveDataBlocking8
     *  @sa         DL_SPI_receiveDataCheck8
     */
    __STATIC_INLINE uint8_t DL_SPI_receiveData8(UNICOMM_Inst_Regs *unicomm)
    {
        return ((uint8_t)(unicomm->spi->RXDATA));
    }

    /**
     *  @brief      Reads 16-bit data from the RX FIFO
     *              从接收 FIFO 读取 16 位数据（不检查状态）
     *
     *  Reads the data from the RX FIFO without checking its status. Use if
     *  already sure the RX FIFO has data available. See related APIs for
     *  additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 16 位数据。
     *
     *  @sa         DL_SPI_receiveDataBlocking16
     *  @sa         DL_SPI_receiveDataCheck16
     */
    __STATIC_INLINE uint16_t DL_SPI_receiveData16(UNICOMM_Inst_Regs *unicomm)
    {
        return ((uint16_t)(unicomm->spi->RXDATA));
    }

    /**
     *  @brief      Enable SPI interrupts  使能 SPI 中断
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：中断掩码（按位或）。
     */
    __STATIC_INLINE void DL_SPI_enableInterrupt(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->spi->CPU_INT.IMASK |= interruptMask;
    }

    /**
     *  @brief      Disable SPI interrupts  禁用 SPI 中断
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：中断掩码（按位或）。
     */
    __STATIC_INLINE void DL_SPI_disableInterrupt(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->spi->CPU_INT.IMASK &= ~(interruptMask);
    }

    /**
     *  @brief      Check which SPI interrupts are enabled  查询已使能的 SPI 中断
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：待查询中断掩码。
     *
     *  @return     Which of the requested SPI interrupts are enabled
     *              返回值：已使能的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_SPI_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledInterrupts(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->CPU_INT.IMASK & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of enabled SPI interrupts
     *              查询已使能中断的挂起状态
     *
     *  Checks if any of the SPI interrupts that were previously enabled are
     *  pending.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：待查询中断掩码。
     *
     *  @return     Which of the requested SPI interrupts are pending
     *              返回值：已使能且挂起的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_SPI_INTERRUPT values
     *
     *  @sa         DL_SPI_enableInterrupt
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->CPU_INT.MIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of any SPI interrupt
     *              查询原始中断挂起状态（不依赖使能）
     *
     *  Checks if any of the SPI interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：待查询中断掩码。
     *
     *  @return     Which of the requested SPI interrupts are pending
     *              返回值：挂起的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_SPI_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_SPI_getRawInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->CPU_INT.RIS & interruptMask);
    }

    /**
     *  @brief      Get highest priority pending SPI interrupt
     *              获取最高优先级的挂起中断
     *
     *  Checks if any of the SPI interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The highest priority pending SPI interrupt. One of @ref
     *               DL_SPI_IIDX
     *              返回值：最高优先级中断索引。
     */
    __STATIC_INLINE DL_SPI_IIDX DL_SPI_getPendingInterrupt(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((DL_SPI_IIDX)unicomm->spi->CPU_INT.IIDX);
    }

    /**
     *  @brief      Clear pending SPI interrupts  清除挂起的 SPI 中断
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
     *                             @ref DL_SPI_INTERRUPT.
     *                             参数：待清除中断掩码。
     */
    __STATIC_INLINE void DL_SPI_clearInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->spi->CPU_INT.ICLR = interruptMask;
    }

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See
     *  related APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 8 位数据。
     *
     *  功能：阻塞等待 TX FIFO 可写后发送 8 位数据。
     *
     *  @sa         DL_SPI_transmitData8
     *  @sa         DL_SPI_transmitDataCheck8
     *  @return     返回值：无。
     */
    void DL_SPI_transmitDataBlocking8(UNICOMM_Inst_Regs *unicomm, uint8_t data);

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 16 位数据。
     *
     *  功能：阻塞等待 TX FIFO 可写后发送 16 位数据。
     *
     *  @sa         DL_SPI_transmitData16
     *  @sa         DL_SPI_transmitDataCheck16
     *  @return     返回值：无。
     */
    void DL_SPI_transmitDataBlocking16(UNICOMM_Inst_Regs *unicomm, uint16_t data);

    /**
     *  @brief      Blocks to ensure transmit is ready before sending data
     *
     *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
     *  full. Will wait indefinitely until there is space in the TX FIFO. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 32 位数据。
     *
     *  功能：阻塞等待 TX FIFO 可写后发送 32 位数据。
     *
     *  @sa         DL_SPI_transmitData32
     *  @sa         DL_SPI_transmitDataCheck32
     *  @return     返回值：无。
     */
    void DL_SPI_transmitDataBlocking32(UNICOMM_Inst_Regs *unicomm, uint32_t data);

    /**
     *  @brief      Blocks to ensure receive is ready before reading data
     *
     *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
     *  empty. Will wait indefinitely until there is data in the RX FIFO. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *
     *  功能：阻塞等待 RX FIFO 非空后读取 8 位数据。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 8 位数据。
     *
     *  @sa         DL_SPI_transmitData8
     *  @sa         DL_SPI_transmitDataCheck8
     */
    uint8_t DL_SPI_receiveDataBlocking8(UNICOMM_Inst_Regs *unicomm);

    /**
     *  @brief      Blocks to ensure receive is ready before reading data
     *
     *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
     *  empty. Will wait indefinitely until there is data in the RX FIFO. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *
     *  功能：阻塞等待 RX FIFO 非空后读取 16 位数据。
     *
     *  @return     The data in the RX FIFO
     *              返回值：读取到的 16 位数据。
     *
     *  @sa         DL_SPI_transmitData16
     *  @sa         DL_SPI_transmitDataCheck16
     */
    uint16_t DL_SPI_receiveDataBlocking16(UNICOMM_Inst_Regs *unicomm);

    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 8 位数据。
     *
     *  功能：尝试发送 8 位数据，若 TX FIFO 已满立即返回失败。
     *
     *  @return     If the transmit occurred
     *              返回值：`true` 成功发送，`false` 表示 FIFO 满。
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *
     *  @sa         DL_SPI_transmitData8
     *  @sa         DL_SPI_transmitDataBlocking8
     */
    bool DL_SPI_transmitDataCheck8(UNICOMM_Inst_Regs *unicomm, uint8_t data);

    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 16 位数据。
     *
     *  功能：尝试发送 16 位数据，若 TX FIFO 已满立即返回失败。
     *
     *  @return     If the transmit occurred
     *              返回值：`true` 成功发送，`false` 表示 FIFO 满。
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *
     *  @sa         DL_SPI_transmitData16
     *  @sa         DL_SPI_transmitDataBlocking16
     */
    bool DL_SPI_transmitDataCheck16(UNICOMM_Inst_Regs *unicomm, uint16_t data);

    /**
     *  @brief      Checks the TX FIFO before trying to transmit data
     *
     *  Checks if the TX FIFO is already full before trying to add new data to the
     *  FIFO. Exits immediately if full rather than trying to block. See related
     *  APIs for additional transmit options.
     *
     *  Can be used for any data transfers that are less than or equal to 32 bits.
     *
     *  @param[in]  unicomm   pointer to the register overlay for the peripheral
     *                        参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data  data to send
     *                    参数：待发送 32 位数据。
     *
     *  功能：尝试发送 32 位数据，若 TX FIFO 已满立即返回失败。
     *
     *  @return     If the transmit occurred
     *              返回值：`true` 成功发送，`false` 表示 FIFO 满。
     *
     *  @retval     true  if data was added to the TX FIFO
     *  @retval     false if the TX FIFO was full and data was not added
     *
     *  @sa         DL_SPI_transmitData32
     *  @sa         DL_SPI_transmitDataBlocking32
     */
    bool DL_SPI_transmitDataCheck32(UNICOMM_Inst_Regs *unicomm, uint32_t data);

    /**
     *  @brief      Checks the RX FIFO before trying to transmit data
     *
     *  Checks if the RX FIFO is already empty before trying to read new data from
     *  the FIFO. Exits immediately if empty rather than trying to block. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 8 bits.
     *
     *  @param[in]  unicomm    pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer a buffer to write the received data into
     *                     参数：接收输出缓冲区指针。
     *
     *  功能：尝试读取 8 位数据，若 RX FIFO 为空立即返回失败。
     *
     *  @return     If the receive occurred
     *              返回值：`true` 读取成功，`false` 表示 FIFO 空。
     *
     *  @retval     true  if data was read from the RX FIFO
     *  @retval     false if the RX FIFO was empty and data was not read
     *
     *  @sa         DL_SPI_receiveData8
     *  @sa         DL_SPI_receiveDataBlocking8
     */
    bool DL_SPI_receiveDataCheck8(UNICOMM_Inst_Regs *unicomm, uint8_t *buffer);

    /**
     *  @brief      Checks the RX FIFO before trying to transmit data
     *
     *  Checks if the RX FIFO is already empty before trying to read new data from
     *  the FIFO. Exits immediately if empty rather than trying to block. See
     *  related APIs for additional receive options.
     *
     *  Can be used for any data transfers that are less than or equal to 16 bits.
     *
     *  @param[in]  unicomm    pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer a buffer to write the received data into
     *                     参数：接收输出缓冲区指针。
     *
     *  功能：尝试读取 16 位数据，若 RX FIFO 为空立即返回失败。
     *
     *  @return     If the receive occurred
     *              返回值：`true` 读取成功，`false` 表示 FIFO 空。
     *
     *  @retval     true  if data was read from the RX FIFO
     *  @retval     false if the RX FIFO was empty and data was not read
     *
     *  @sa         DL_SPI_receiveData16
     *  @sa         DL_SPI_receiveDataBlocking16
     */
    bool DL_SPI_receiveDataCheck16(UNICOMM_Inst_Regs *unicomm, uint16_t *buffer);

    /**
     *  @brief       Read all available data out of the RX FIFO using 8 bit access
     *
     *  @param[in]   unicomm   Pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[out]  buffer    Buffer to write received data into
     *                         参数：接收缓冲区。
     *  @param[in]   maxCount  Max number of bytes to read from the RX FIFO
     *                         参数：最大读取字节数。
     *
     *  @return      Number of bytes read from the RX FIFO
     *               返回值：实际读取字节数。
     *
     *  功能：批量读取 RX FIFO 中可用的 8 位数据。
     */
    uint32_t DL_SPI_drainRXFIFO8(
        UNICOMM_Inst_Regs *unicomm, uint8_t *buffer, uint32_t maxCount);

