zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommspi.h
    /**
     *  @brief       Read all available data out of the RX FIFO using 16 bit access
     *
     *  @param[in]   unicomm   Pointer to the register overlay for the peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[out]  buffer    Buffer to write received data into
     *                         参数：接收缓冲区。
     *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
     *                         参数：最大读取半字数。
     *
     *  @return      Number of halfwords read from the RX FIFO
     *               返回值：实际读取半字数。
     *
     *  功能：批量读取 RX FIFO 中可用的 16 位数据。
     */
    uint32_t DL_SPI_drainRXFIFO16(
        UNICOMM_Inst_Regs *unicomm, uint16_t *buffer, uint32_t maxCount);

    /**
     *  @brief      Fill the TX FIFO using 8 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                      参数：发送缓冲区。
     *  @param[in]  count   Max number of bytes to write to the TX FIFO
     *                      参数：最大写入字节数。
     *
     *  @return     Number of bytes written to the TX FIFO
     *              返回值：实际写入字节数。
     *
     *  功能：批量向 TX FIFO 写入 8 位数据，直到 FIFO 满或达到上限。
     */
    uint32_t DL_SPI_fillTXFIFO8(
        UNICOMM_Inst_Regs *unicomm, uint8_t *buffer, uint32_t count);

    /**
     *  @brief      Fill the TX FIFO using 16 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                      参数：发送缓冲区。
     *  @param[in]  count   Max number of halfwords to write to the TX FIFO
     *                      参数：最大写入半字数。
     *
     *  @return     Number of halfwords written to the TX FIFO
     *              返回值：实际写入半字数。
     *
     *  功能：批量向 TX FIFO 写入 16 位数据，直到 FIFO 满或达到上限。
     */
    uint32_t DL_SPI_fillTXFIFO16(
        UNICOMM_Inst_Regs *unicomm, uint16_t *buffer, uint32_t count);

    /**
     *  @brief      Fill the TX FIFO using 32 bit access
     *
     *  Continuously write data into the TX FIFO until it is filled up or count has
     *  been reached.
     *  entries.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer  Buffer of data to write to the TX FIFO
     *                      参数：发送缓冲区。
     *  @param[in]  count   Max number of words to write to the TX FIFO
     *                      参数：最大写入字数。
     *
     *  @return     Number of words written to the TX FIFO
     *              返回值：实际写入字数。
     *
     *  功能：批量向 TX FIFO 写入 32 位数据，直到 FIFO 满或达到上限。
     */
    uint32_t DL_SPI_fillTXFIFO32(
        UNICOMM_Inst_Regs *unicomm, uint32_t *buffer, uint32_t count);

    /**
     *  @brief      Enable SPI interrupt for triggering the DMA receive event
     *              使能 SPI 接收 DMA 触发中断
     *
     * Enables the SPI interrupt to be used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
     * register, which is the event publisher used for triggering the DMA to do
     * a receive data transfer.
     *
     * @note Only one interrupt source should be enabled at a time.
     *
     *  @param[in]  unicomm       Pointer to the register overlay for the
     *                         peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
     *                         the DMA. One of @ref DL_SPI_DMA_INTERRUPT_RX.
     *                         参数：DMA 接收触发中断源。
     */
    __STATIC_INLINE void DL_SPI_enableDMAReceiveEvent(
        UNICOMM_Inst_Regs *unicomm, uint32_t interrupt)
    {
        unicomm->spi->DMA_TRIG_RX.IMASK = interrupt;
    }

    /**
     *  @brief      Enable SPI interrupt for triggering the DMA transmit event
     *              使能 SPI 发送 DMA 触发中断
     *
     * Enables the SPI interrupt to be used as the condition to generate an
     * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
     * register, which is the event publisher used for triggering the DMA to do
     * a transmit data transfer.
     *
     * @note DMA_TRIG_TX only has one transmit interrupt source
     *
     *  @param[in]  unicomm       Pointer to the register overlay for the
     *                         peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enableDMATransmitEvent(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->DMA_TRIG_TX.IMASK = UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_SET;
    }

    /**
     *  @brief      Disables SPI interrupt from triggering the DMA receive event
     *              禁用 SPI 接收 DMA 触发中断
     *
     * Disables the SPI interrupt as the condition to generate an event to
     * directly trigger the DMA. This API configures the DMA_TRIG_RX
     * register, which is the event publisher used for triggering the DMA to do
     * a receive data transfer.
     *
     *  @param[in]  unicomm       Pointer to the register overlay for the
     *                         peripheral
     *                         参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
     *                         the DMA. One of @ref DL_SPI_DMA_INTERRUPT_RX.
     *                         参数：待禁用的 DMA 接收触发中断源。
     */
    __STATIC_INLINE void DL_SPI_disableDMAReceiveEvent(
        UNICOMM_Inst_Regs *unicomm, uint32_t interrupt)
    {
        unicomm->spi->DMA_TRIG_RX.IMASK &= ~(interrupt);
    }

    /**
     *  @brief      Disables SPI interrupt from triggering the DMA transmit event
     *              禁用 SPI 发送 DMA 触发中断
     *
     * Disables the SPI interrupt as the condition to generate an event to
     * directly trigger the DMA. This API configures the DMA_TRIG_TX
     * register, which is the event publisher used for triggering the DMA to do
     * a transmit data transfer.
     *
     * @note DMA_TRIG_TX only has one transmit interrupt source
     *
     * @param[in]  unicomm       Pointer to the register overlay for the
     *                       peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disableDMATransmitEvent(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->DMA_TRIG_TX.IMASK = UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_CLR;
    }

    /**
     *  @brief      Check which SPI interrupt for DMA receive events is enabled
     *              查询已使能的 DMA 接收触发中断
     *
     *  This API checks the DMA_TRIG_RX register, which is the event publisher used
     *  for triggering the DMA to do a receive data transfer.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_DMA_INTERRUPT_RX.
     *                             参数：待查询中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     Which of the requested SPI interrupts is enabled
     *              返回值：已使能的 DMA 接收触发中断。
     *
     *  @retval     One of @ref DL_SPI_DMA_INTERRUPT_RX
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledDMAReceiveEvent(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->DMA_TRIG_RX.IMASK & interruptMask);
    }

    /**
     *  @brief      Check if SPI interrupt for DMA transmit event is enabled
     *              查询 DMA 发送触发中断是否已使能
     *
     *  This API checks the DMA_TRIG_TX register, which is the event publisher used
     *  for triggering the DMA to do a transmit data transfer.
     *
     *  @param[in]  unicomm           Pointer to the register overlay for the
     *                            peripheral
     *                            参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The requested SPI interrupt status
     *              返回值：DMA 发送触发中断使能状态。
     *
     *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledDMATransmitEvent(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->spi->DMA_TRIG_TX.IMASK &
                UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_MASK);
    }

    /**
     *  @brief      Check interrupt flag of enabled SPI interrupt for DMA receive event
     *              查询已使能的 DMA 接收触发中断挂起状态
     *
     * Checks if any of the SPI interrupts for the DMA receive event that were
     * previously enabled are pending.
     * This API checks the DMA_TRIG_RX register, which is the event publisher used
     * for triggering the DMA to do a receive data transfer.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_DMA_INTERRUPT_RX.
     *                             参数：待查询中断掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested SPI interrupt status
     *              返回值：挂起状态。
     *
     *  @retval     One of @ref DL_SPI_DMA_INTERRUPT_RX
     *
     *  @sa         DL_SPI_enableDMAReceiveEvent
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledDMAReceiveEventStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->DMA_TRIG_RX.MIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of enabled SPI interrupt for DMA transmit event
     *              查询已使能的 DMA 发送触发中断挂起状态
     *
     * Checks if the SPI interrupt for the DMA transmit event that was
     * previously enabled is pending.
     * This API checks the DMA_TRIG_TX register, which is the event publisher used
     * for triggering the DMA to do a transmit data transfer.
     *
     *  @param[in]  unicomm           Pointer to the register overlay for the
     *                            peripheral
     *                            参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The requested SPI interrupt status
     *              返回值：DMA 发送触发中断挂起状态。
     *
     *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
     *
     *  @sa         DL_SPI_enableDMATransmitEvent
     */
    __STATIC_INLINE uint32_t DL_SPI_getEnabledDMATransmitEventStatus(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (
            unicomm->spi->DMA_TRIG_TX.MIS & UNICOMMSPI_DMA_TRIG_TX_MIS_TX_MASK);
    }

    /**
     *  @brief      Check interrupt flag of any SPI interrupt for DMA receive event
     *              查询 DMA 接收触发中断原始挂起状态（不依赖使能）
     *
     *  Checks if any of the SPI interrupts for DMA receive event are pending.
     *  Interrupts do not have to be previously enabled.
     *  This API checks the DMA_TRIG_RX register, which is the event publisher used
     *  for triggering the DMA to do a receive data transfer.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_SPI_DMA_INTERRUPT_RX.
     *                             参数：待查询中断掩码。
     *
     *  @return     Which of the requested SPI interrupts are pending
     *              返回值：挂起的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_SPI_DMA_INTERRUPT_RX values
     */
    __STATIC_INLINE uint32_t DL_SPI_getRawDMAReceiveEventStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->spi->DMA_TRIG_RX.RIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of any SPI interrupt for DMA transmit event
     *              查询 DMA 发送触发中断原始挂起状态（不依赖使能）
     *
     *  Checks if any of the SPI interrupts for DMA transmit event are pending.
     *  Interrupts do not have to be previously enabled.
     *  This API checks the DMA_TRIG_TX register, which is the event publisher used
     *  for triggering the DMA to do a transmit data transfer.
     *
     *  @param[in]  unicomm           Pointer to the register overlay for the
     *                            peripheral
     *                            参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The requested SPI interrupt status
     *              返回值：DMA 发送触发中断挂起状态。
     *
     *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
     */
    __STATIC_INLINE uint32_t DL_SPI_getRawDMATransmitEventStatus(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (
            unicomm->spi->DMA_TRIG_TX.RIS & UNICOMMSPI_DMA_TRIG_TX_RIS_TX_MASK);
    }

    /**
     *  @brief      Save SPI configuration before entering a power loss state.
     *
     *  Some peripherals residing in PD1 domain do not retain register
     *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
     *  for the full list of peripheral instances that exhibit this behavior.
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @param[in]  ptr  Configuration backup setup structure. See
     *                  @ref DL_SPI_backupConfig.
     *                  参数：配置备份结构体。
     *
     *  @retval     FALSE if a configuration already exists in ptr (will not be
     *              overwritten). TRUE if a configuration was successfully saved
     *
     *  功能：保存 SPI 关键寄存器配置用于掉电恢复。
     *  @return     返回值：`true` 保存成功，`false` 表示已存在有效备份。
     *
     *  @sa         DL_SPI_restoreConfiguration
     */
    bool DL_SPI_saveConfiguration(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_backupConfig *ptr);

    /**
     *  @brief      Restore SPI configuration after leaving a power loss state.
     *
     *  Some peripherals residing in PD1 domain do not retain register
     *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
     *  for the full list of peripheral instances that exhibit this behavior.
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @param[in]  ptr   Configuration backup setup structure. See
     *                    @ref DL_SPI_backupConfig.
     *                    参数：配置备份结构体。
     *
     *  @retval     FALSE if a configuration does not exist in ptr (will not be
     *              loaded). TRUE if a configuration successfully loaded
     *
     *  功能：恢复 SPI 关键寄存器配置并回到工作状态。
     *  @return     返回值：`true` 恢复成功，`false` 表示无有效备份。
     *
     *  @sa         DL_SPI_saveConfiguration
     */
    bool DL_SPI_restoreConfiguration(
        UNICOMM_Inst_Regs *unicomm, DL_SPI_backupConfig *ptr);

    /**
     *  @brief      Suspend external communication  挂起外部通信
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_enableSuspend(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_SUSPEND_ENABLE;
    }

    /**
     *  @brief      Resume external communication  恢复外部通信
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_SPI_disableSuspend(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_SUSPEND_MASK);
    }

#ifdef __cplusplus
}
#endif

#endif /* __MCU_HAS_UNICOMMSPI__ */

#endif /* ti_dl_dl_UNICOMMSPI__include */
/** @}*/
